<template>
  <div class="about w-50">
    <h1>Тестовое задание</h1>
    <br>
    <h3>Необходимо будет сделать странички управления пользователями. С использованием NuxyJs. Дизайн, макет и прочее -
      на усмотрение.</h3>

    <p>Необходимо установить чистый NuxtJs фреймворк.
    <p>
    <p>В нем создать страницу со списком пользователей. На этой странице можно:
    <p>
    <ol>
      <li>
        перейти в пользователя и посмотреть его данные.
      </li>
      <li>
        перейти в пользователя и отредактировать его данные. Т.е. отобразить форму с данными. Сохранение не нужно.
      </li>
    </ol>
    <p>
      Итого 3 страницы. Все данные пользователей определять прямо в коде.
    </p>

    <p>
      Данные пользователей использовать по структуре:
    </p>
    <span>
      {
    </span>
    <ul>
      <li>
        id,
      </li>
      <li>
        login, //имя входа
      </li>
      <li>
        family_name, // Фамилия
      </li>
      <li>
        first_name, // Имя
      </li>
      <li>
        middle_name, // Отчество
      </li>
      <li>
        email, // email
      </li>
      <li>
        phone, // телефон
      </li>
      <li>
        password, // пароль. должен быть скрыт
      </li>
      <li>
        secret_word, // секретное слово
      </li>
      <li>
        created_at, // Дата создания
      </li>
      <li>
        updated_at, // дата изменения
      </li>
    </ul>
    <span>
      }
    </span>
    <hr>
    <p>
      Дополнительный баллы начисляются:
    </p>
    <ol>
      <li>
        Использование конфига .env
      </li>
      <li>
        Использование bootstrap 4
      </li>
      <li>
        Красиво оформленный интерфейс.
      </li>
      <li>
        Создать дополнительные кнопки для удобства - типа редактировать, сменить пароль
      </li>
      <li>
        Использование sass/scss
      </li>
      <li>
        Использовать API запрос на получение данных пользователя. (Положить данные в /static/users.json и
        /static/user.json) (Либо сторонний сервер)
      </li>
      <li>
        Использовать авторизацию по кнопке и проверку при входе в интерфейс.(Vuex)
      </li>
      <li>
        Написать 2 интерфейса в /admin и /lk с аналогичным функционалом.
      </li>
    </ol>
    <p>
      <i>
        Не надо пытаться использовать все дополнительные баллы. Выполнять только те моменты с которыми Вы справитесь.
        Оцениваться будет как выполнена основная задача и оформление. Лучше время потратить на это.
      </i>
    </p>
    <hr>
    <p>
      Необходимое затраченное время до 16 часов.
    </p>
    <p>
      Время на установку фреймворка nuxtJs и nodeJs - не учитывается.
    </p>
    <p>
      Учитывается только то время - которое Вы потратили на разработку.
    </p>
    <p>
      В сопровождении указать с чем были сложности, что пришлось изучать, и на что было потрачено время.
    </p>
  </div>
</template>

<script>
export default {
  name: "About"
}
</script>

<style lang="scss">
.about {
  margin: 0 auto;
}
</style>
